fio_test/fin_test_largefiles_efuse
largefiles_randrw_efuse: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 8 threads
largefiles_randrw_efuse: Laying out IO files (5 files / total 1000MiB)
largefiles_randrw_efuse: Laying out IO files (5 files / total 1000MiB)
largefiles_randrw_efuse: Laying out IO files (5 files / total 1000MiB)
[...]

largefiles_randrw_efuse: (groupid=0, jobs=8): err= 0: pid=7403: Sat Aug  9 22:10:50 2025
  read: IOPS=21.7k, BW=84.7MiB/s (88.8MB/s)(5080MiB/60002msec)
    slat (usec): min=104, max=26112, avg=357.21, stdev=176.93
    clat (usec): min=4, max=49625, avg=15929.45, stdev=3419.33
     lat (usec): min=418, max=51042, avg=16287.19, stdev=3476.65
    clat percentiles (usec):
     |  1.00th=[11207],  5.00th=[12125], 10.00th=[12649], 20.00th=[13304],
     | 30.00th=[13829], 40.00th=[14222], 50.00th=[14877], 60.00th=[15533],
     | 70.00th=[16712], 80.00th=[19006], 90.00th=[21365], 95.00th=[22676],
     | 99.00th=[25297], 99.50th=[26346], 99.90th=[32900], 99.95th=[36439],
     | 99.99th=[42206]
   bw (  KiB/s): min=72176, max=98048, per=100.00%, avg=86747.70, stdev=664.55, samples=952
   iops        : min=18044, max=24512, avg=21686.66, stdev=166.14, samples=952
  write: IOPS=9294, BW=36.3MiB/s (38.1MB/s)(2179MiB/60002msec); 0 zone resets
    slat (usec): min=2, max=12062, avg=11.15, stdev=50.70
    clat (usec): min=738, max=73319, avg=17075.93, stdev=3828.89
     lat (usec): min=746, max=75941, avg=17087.23, stdev=3832.20
    clat percentiles (usec):
     |  1.00th=[11994],  5.00th=[12911], 10.00th=[13566], 20.00th=[14222],
     | 30.00th=[14746], 40.00th=[15270], 50.00th=[15926], 60.00th=[16712],
     | 70.00th=[17957], 80.00th=[20055], 90.00th=[22152], 95.00th=[23725],
     | 99.00th=[28705], 99.50th=[33817], 99.90th=[44827], 99.95th=[50594],
     | 99.99th=[57934]
   bw (  KiB/s): min=30144, max=43976, per=100.00%, avg=37201.39, stdev=356.32, samples=952
   iops        : min= 7536, max=10994, avg=9299.94, stdev=89.09, samples=952
  lat (usec)   : 10=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.06%, 20=82.95%, 50=16.97%
  lat (msec)   : 100=0.02%
  cpu          : usr=3.74%, sys=14.39%, ctx=1301076, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=1300527,557710,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=84.7MiB/s (88.8MB/s), 84.7MiB/s-84.7MiB/s (88.8MB/s-88.8MB/s), io=5080MiB (5327MB), run=60002-60002msec
  WRITE: bw=36.3MiB/s (38.1MB/s), 36.3MiB/s-36.3MiB/s (38.1MB/s-38.1MB/s), io=2179MiB (2284MB), run=60002-60002msec